app/controllers/alluserblogs_controller.rb

SELECT "userblogs".* FROM "userblogs"
---
  def index
    @userblogs = Userblog.all