app/controllers/entries_controller.rb

  def index
    #raise params.to_yaml

    @entries = Entry.find_all_by_userblog_id(params[:userblog_id])
    @userblog = Userblog.find(params[:userblog_id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."userblog_id" IS NULL
SELECT "userblogs".* FROM "userblogs" WHERE "userblogs"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @userblog = Userblog.find(params[:userblog_id])
---
SELECT "userblogs".* FROM "userblogs" WHERE "userblogs"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    #raise params.to_yaml
    @entry = Entry.new(params[:entry])
    @entry.save
---
INSERT INTO "entries" ("content", "created_at", "title", "updated_at", "userblog_id") VALUES (?, ?, ?, ?, ?)  [["content", "test driven development"], ["created_at", Fri, 24 Apr 2015 22:56:41 UTC +00:00], ["title", "Rspec"], ["updated_at", Fri, 24 Apr 2015 22:56:41 UTC +00:00], ["userblog_id", 1]]