app/controllers/userblogs_controller.rb

SELECT "userblogs".* FROM "userblogs" WHERE "userblogs"."user_id" IS NULL
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def index
    @userblogs = Userblog.find_all_by_user_id(params[:user_id])
    #raise params.inspect
    @user = User.find(params[:user_id])

SELECT "userblogs".* FROM "userblogs" WHERE "userblogs"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    #raise params.inspect
    @userblog = Userblog.find(params[:id])
    @user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    #raise params.inspect
    @user = User.find(params[:user_id])

SELECT "userblogs".* FROM "userblogs" WHERE "userblogs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @userblog = Userblog.find(params[:id])

INSERT INTO "userblogs" ("created_at", "description", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 09 Apr 2015 00:23:00 UTC +00:00], ["description", "haml tutorial"], ["title", "Haml Notes"], ["updated_at", Thu, 09 Apr 2015 00:23:00 UTC +00:00], ["user_id", 1]]
---
  def create
    #raise params.inspect
    #@userblog = params[:userblog]
    #raise @userblog.inspect

    @userblog = Userblog.new(params[:userblog])
    @userblog.save